Внимание! У разных вариантов разный текст задания!
Составить запросы на языке SQL (пункты 1-7).

Сделать запрос для получения атрибутов из указанных таблиц, 
применив фильтры по указанным условиям:
Таблицы: Н_ЛЮДИ, Н_СЕССИЯ.
Вывести атрибуты: Н_ЛЮДИ.ФАМИЛИЯ, Н_СЕССИЯ.ЧЛВК_ИД.
Фильтры (AND): 
a) Н_ЛЮДИ.ФАМИЛИЯ > Ёлкин.
b) Н_СЕССИЯ.ИД > 14.
c) Н_СЕССИЯ.ИД > 27640.
Вид соединения: INNER JOIN.
Сделать запрос для получения атрибутов из указанных таблиц,
применив фильтры по указанным условиям:
Таблицы: Н_ЛЮДИ, Н_ОБУЧЕНИЯ, Н_УЧЕНИКИ.
Вывести атрибуты: Н_ЛЮДИ.ИД, Н_ОБУЧЕНИЯ.ЧЛВК_ИД, Н_УЧЕНИКИ.НАЧАЛО.
Фильтры: (AND)
a) Н_ЛЮДИ.ИД = 142095.
b) Н_ОБУЧЕНИЯ.ЧЛВК_ИД = 163484.
Вид соединения: LEFT JOIN.
Составить запрос, который ответит на вопрос, есть ли среди студентов 
вечерней формы обучения те, кто старше 25 лет.
Найти группы, в которых в 2011 году было более 10 обучающихся студентов 
на ФКТИУ.
Для реализации использовать подзапрос.
Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО,
Ср_оценка), у которых средняя оценка равна максимальной оценк(е|и) в группе 3100.
Получить список студентов, отчисленных до первого сентября 2012 года с 
очной или заочной формы обучения (специальность: Программная инженерия).
В результат включить:
номер группы;
номер, фамилию, имя и отчество студента;
номер пункта приказа;
Для реализации использовать соединение таблиц.
Вывести список людей, не являющихся или не являвшихся студентами ФКТИУ 
(данные, о которых отсутствуют в таблице Н_УЧЕНИКИ). В запросе нельзя
использовать DISTINCT.
